backend/tests/load/scenarios/stress-test.yml
config:
  target: "http://localhost:5000"
  processor: "../processor.js"
  phases:
    # Gradual ramp up
    - duration: 60
      arrivalRate: 50
      name: "Stage 1: 50 req/sec"
    - duration: 60
      arrivalRate: 100
      name: "Stage 2: 100 req/sec"
    - duration: 60
      arrivalRate: 200
      name: "Stage 3: 200 req/sec"
    - duration: 60
      arrivalRate: 400
      name: "Stage 4: 400 req/sec"
    - duration: 60
      arrivalRate: 800
      name: "Stage 5: 800 req/sec - STRESS"
    - duration: 60
      arrivalRate: 1000
      name: "Stage 6: 1000 req/sec - MAX STRESS"
    - duration: 60
      arrivalRate: 1500
      name: "Stage 7: 1500 req/sec - BREAKING POINT"
    # Cool down
    - duration: 60
      arrivalRate: 50
      name: "Cool down"
  variables:
    authToken: ""

scenarios:
  - name: "Heavy Read Load"
    weight: 60
    flow:
      - get:
          url: "/api/health"
      
      - get:
          url: "/api/posts"
          headers:
            Authorization: "Bearer {{ authToken }}"

  - name: "Mixed Operations"
    weight: 30
    flow:
      - get:
          url: "/api/profile/me"
          headers:
            Authorization: "Bearer {{ authToken }}"
      
      - get:
          url: "/api/alumni/status"
          headers:
            Authorization: "Bearer {{ authToken }}"

  - name: "Profile Reads"
    weight: 10
    flow:
      - get:
          url: "/api/queries/my"
          headers:
            Authorization: "Bearer {{ authToken }}"
      
      - get:
          url: "/api/posts/search"
          headers:
            Authorization: "Bearer {{ authToken }}"